Revit 2027 API
IFCUserDefinedPropertySet.RemoveProperty Method
 Removes a property from the property set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveProperty(
	string propertyName
)
Public Sub RemoveProperty (
	propertyName As String
)
public:
void RemoveProperty(
	String^ propertyName
)
member RemoveProperty :
        propertyName : string -> unit
Parameters
propertyName String
 The name of the property to remove.
Exceptions
Exception | Condition
ArgumentException |  A property with the given name is not present in the property set.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace